#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/m-oka-system/azphoto/runs/run-VK451BPCDJsTZsAT

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
random_integer.num: Refreshing state... [id=56189]
data.azurerm_subscription.primary: Refreshing...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg]
data.azurerm_subscription.primary: Refresh complete after 0s [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36]
azurerm_cdn_frontdoor_profile.profile: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd]
azurerm_private_dns_zone.mysql: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/azphoto-dev-mysql-56189.private.mysql.database.azure.com]
azurerm_redis_cache.redis: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cache/Redis/azphoto-dev-redis-56189]
azurerm_user_assigned_identity.webappcontainer: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azphoto-dev-webappcontainer-mngid]
module.blob_pep.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
azurerm_virtual_network.spoke1: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.ContainerRegistry/registries/azphotodevacr]
azurerm_dns_zone.public: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/dnsZones/udemy-azure-paas.xyz]
azurerm_storage_account.app: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Storage/storageAccounts/azphotodevacc56189]
module.redis_pep.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net]
module.vault_pep.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
azurerm_key_vault.app: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault]
azurerm_subnet.spoke1_app: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/app]
azurerm_subnet.spoke1_endpoint: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/endpoint]
azurerm_subnet.spoke1_db: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/db]
azurerm_cdn_frontdoor_origin_group.app: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/originGroups/azphoto-dev-afd-app-backend]
azurerm_cdn_frontdoor_endpoint.endpoint: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/afdEndpoints/azphoto-dev-afd-endpoint]
azurerm_cdn_frontdoor_origin_group.blob: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/originGroups/azphoto-dev-afd-blob-backend]
module.redis_pep.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/vnetlink]
azurerm_role_assignment.webappcontainer[0]: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Authorization/roleAssignments/0cb779e9-3a40-73bc-43ed-8696115e4332]
azurerm_role_assignment.webappcontainer[1]: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Authorization/roleAssignments/06bd59ec-7415-dba2-4b2e-a84992e604ab]
azurerm_cdn_frontdoor_custom_domain.app: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/customDomains/www-udemy-azure-paas-xyz]
azurerm_role_assignment.webappcontainer[2]: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Authorization/roleAssignments/388017e0-068b-7982-32f7-3598481afd08]
azurerm_private_dns_zone_virtual_network_link.mysql: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/azphoto-dev-mysql-56189.private.mysql.database.azure.com/virtualNetworkLinks/mysqlfsVnetZone]
module.blob_pep.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/vnetlink]
module.vault_pep.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/vnetlink]
azurerm_mysql_flexible_server.mysql: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.DBforMySQL/flexibleServers/azphoto-dev-mysql-56189]
azurerm_dns_txt_record.afd_validation: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/dnsZones/udemy-azure-paas.xyz/TXT/_dnsauth.www]
module.redis_pep.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateEndpoints/azphoto-dev-redis-56189-pep]
azurerm_mysql_flexible_database.mysql: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.DBforMySQL/flexibleServers/azphoto-dev-mysql-56189/databases/photo]
azurerm_mysql_flexible_server_configuration.ssl_config: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.DBforMySQL/flexibleServers/azphoto-dev-mysql-56189/configurations/require_secure_transport]
module.vault_pep.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateEndpoints/azphoto-dev-vault-pep]
module.redis_pep.azurerm_private_dns_a_record.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/A/azphoto-dev-redis-56189]
azurerm_storage_container.media: Refreshing state... [id=https://azphotodevacc56189.blob.core.windows.net/media]
azurerm_cdn_frontdoor_origin.blob: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/originGroups/azphoto-dev-afd-blob-backend/origins/azphoto-dev-afd-blob-origin]
azurerm_storage_container.static: Refreshing state... [id=https://azphotodevacc56189.blob.core.windows.net/static]
module.blob_pep.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateEndpoints/azphotodevacc56189-pep]
azurerm_cdn_frontdoor_route.blob: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/afdEndpoints/azphoto-dev-afd-endpoint/routes/azphoto-dev-afd-blob-route]
module.vault_pep.azurerm_private_dns_a_record.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/A/azphoto-dev-vault]
module.blob_pep.azurerm_private_dns_a_record.this: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/A/azphotodevacc56189]
module.vault_pep.azurerm_private_dns_zone.this: Drift detected (update)
module.vault_pep.azurerm_private_dns_zone_virtual_network_link.this: Drift detected (update)
module.vault_pep.azurerm_private_endpoint.this: Drift detected (update)
module.vault_pep.azurerm_private_dns_a_record.this: Drift detected (update)
azurerm_storage_account.app: Drift detected (update)
azurerm_subnet.spoke1_app: Drift detected (update)
azurerm_cdn_frontdoor_endpoint.endpoint: Drift detected (update)
azurerm_dns_txt_record.afd_validation: Drift detected (update)
azurerm_subnet.spoke1_db: Drift detected (update)
azurerm_key_vault.app: Drift detected (update)
azurerm_dns_zone.public: Drift detected (update)
azurerm_redis_cache.redis: Drift detected (update)
azurerm_cdn_frontdoor_profile.profile: Drift detected (update)
azurerm_virtual_network.spoke1: Drift detected (update)
azurerm_mysql_flexible_server.mysql: Drift detected (update)
azurerm_subnet.spoke1_endpoint: Drift detected (update)
azurerm_container_registry.acr: Drift detected (update)
azurerm_cdn_frontdoor_custom_domain.app: Drift detected (update)
azurerm_private_dns_zone.mysql: Drift detected (update)
azurerm_user_assigned_identity.webappcontainer: Drift detected (update)
azurerm_cdn_frontdoor_route.blob: Drift detected (update)
azurerm_resource_group.rg: Drift detected (update)
azurerm_private_dns_zone_virtual_network_link.mysql: Drift detected (update)
module.blob_pep.azurerm_private_dns_zone_virtual_network_link.this: Drift detected (update)
module.blob_pep.azurerm_private_endpoint.this: Drift detected (update)
module.blob_pep.azurerm_private_dns_a_record.this: Drift detected (update)
module.blob_pep.azurerm_private_dns_zone.this: Drift detected (update)
module.redis_pep.azurerm_private_endpoint.this: Drift detected (update)
module.redis_pep.azurerm_private_dns_a_record.this: Drift detected (update)
module.redis_pep.azurerm_private_dns_zone.this: Drift detected (update)
module.redis_pep.azurerm_private_dns_zone_virtual_network_link.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.app will be created
  + resource "azurerm_application_insights" "app" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "japaneast"
      + name                                  = "azphoto-dev-app-56189-appinsights"
      + resource_group_name                   = "azphoto-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # azurerm_cdn_frontdoor_custom_domain_association.app will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "app" {
      + cdn_frontdoor_custom_domain_id = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/customDomains/www-udemy-azure-paas-xyz"
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # azurerm_cdn_frontdoor_origin.app will be created
  + resource "azurerm_cdn_frontdoor_origin" "app" {
      + cdn_frontdoor_origin_group_id  = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/originGroups/azphoto-dev-afd-app-backend"
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "azphoto-dev-afd-app-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1000
    }

  # azurerm_cdn_frontdoor_route.app will be created
  + resource "azurerm_cdn_frontdoor_route" "app" {
      + cdn_frontdoor_custom_domain_ids = [
          + "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/customDomains/www-udemy-azure-paas-xyz",
        ]
      + cdn_frontdoor_endpoint_id       = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/afdEndpoints/azphoto-dev-afd-endpoint"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Cdn/profiles/azphoto-dev-afd/originGroups/azphoto-dev-afd-app-backend"
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "azphoto-dev-afd-app-route"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # azurerm_dns_cname_record.afd_cname will be created
  + resource "azurerm_dns_cname_record" "afd_cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "azphoto-dev-afd-endpoint-eag8a2f5dac8d8gs.z01.azurefd.net"
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 3600
      + zone_name           = (sensitive value)
    }

  # azurerm_key_vault.app will be updated in-place
  ~ resource "azurerm_key_vault" "app" {
        id                              = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
        name                            = "azphoto-dev-vault"
        tags                            = {}
        # (13 unchanged attributes hidden)

      ~ network_acls {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_key_vault_secret.appinsights will be created
  + resource "azurerm_key_vault_secret" "appinsights" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "APPINSIGHTS-CONNECTION-STRING"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_host will be created
  + resource "azurerm_key_vault_secret" "db_host" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "DB-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_name will be created
  + resource "azurerm_key_vault_secret" "db_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "DB-NAME"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_password will be created
  + resource "azurerm_key_vault_secret" "db_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "DB-PASSWORD"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.db_username will be created
  + resource "azurerm_key_vault_secret" "db_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "DB-USERNAME"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.default_from_email will be created
  + resource "azurerm_key_vault_secret" "default_from_email" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "DEFAULT-FROM-EMAIL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_host will be created
  + resource "azurerm_key_vault_secret" "redis_host" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "REDIS-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_key will be created
  + resource "azurerm_key_vault_secret" "redis_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "REDIS-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.secret_key will be created
  + resource "azurerm_key_vault_secret" "secret_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "DJANGO-SECRET-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sendgrid_api_key will be created
  + resource "azurerm_key_vault_secret" "sendgrid_api_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "SENDGRID-API-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.webappcontainer_client_id will be created
  + resource "azurerm_key_vault_secret" "webappcontainer_client_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.KeyVault/vaults/azphoto-dev-vault"
      + name                    = "WEBAPPCONTAINER-CLIENT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.app will be created
  + resource "azurerm_linux_web_app" "app" {
      + app_settings                      = {
          + "APPINSIGHTS_CONNECTION_STRING"       = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=APPINSIGHTS-CONNECTION-STRING)"
          + "AZURE_CLIENT_ID"                     = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=WEBAPPCONTAINER-CLIENT-ID)"
          + "DB_HOST"                             = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=DB-HOST)"
          + "DB_NAME"                             = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=DB-NAME)"
          + "DB_PASSWORD"                         = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=DB-PASSWORD)"
          + "DB_PORT"                             = "3306"
          + "DB_USERNAME"                         = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=DB-USERNAME)"
          + "DJANGO_ALLOWED_HOSTS"                = (sensitive value)
          + "DJANGO_AZURE_ACCOUNT_NAME"           = "azphotodevacc56189"
          + "DJANGO_AZURE_MEDIA_CONTAINER"        = "media"
          + "DJANGO_AZURE_STATIC_CONTAINER"       = "static"
          + "DJANGO_DEBUG"                        = "False"
          + "DJANGO_DEFAULT_FROM_EMAIL"           = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=DEFAULT-FROM-EMAIL)"
          + "DJANGO_SECRET_KEY"                   = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=DJANGO-SECRET-KEY)"
          + "DJANGO_SECURE_SSL_REDIRECT"          = "False"
          + "DJANGO_SETTINGS_MODULE"              = "config.settings.production"
          + "DOCKER_REGISTRY_SERVER_URL"          = "https://azphotodevacr.azurecr.io"
          + "REDIS_HOST"                          = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=REDIS-HOST)"
          + "REDIS_KEY"                           = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=REDIS-KEY)"
          + "REDIS_PORT"                          = "6380"
          + "SENDGRID_API_KEY"                    = "@Microsoft.KeyVault(VaultName=azphoto-dev-vault;SecretName=SENDGRID-API-KEY)"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "False"
          + "WEBSITES_PORT"                       = "8000"
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azphoto-dev-webappcontainer-mngid"
      + kind                              = (known after apply)
      + location                          = "japaneast"
      + name                              = "azphoto-dev-app-56189"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "azphoto-dev-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + virtual_network_subnet_id         = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/app"
      + zip_deploy_file                   = (known after apply)

      + identity {
          + identity_ids = [
              + "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azphoto-dev-webappcontainer-mngid",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                                     = false
          + container_registry_managed_identity_client_id = "944253b9-0eb0-4af6-a4c3-0c15b9add9a7"
          + container_registry_use_managed_identity       = true
          + default_documents                             = (known after apply)
          + detailed_error_logging_enabled                = (known after apply)
          + ftps_state                                    = "Disabled"
          + health_check_eviction_time_in_min             = (known after apply)
          + http2_enabled                                 = false
          + ip_restriction                                = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = [
                              + "d4256432-3113-4d83-824b-53fb9a33e7dd",
                            ]
                        },
                    ]
                  + name        = "AllowFrontDoorAddress"
                  + priority    = 100
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                              = (known after apply)
          + load_balancing_mode                           = "LeastRequests"
          + local_mysql_enabled                           = false
          + managed_pipeline_mode                         = "Integrated"
          + minimum_tls_version                           = "1.2"
          + remote_debugging_enabled                      = false
          + remote_debugging_version                      = (known after apply)
          + scm_ip_restriction                            = (known after apply)
          + scm_minimum_tls_version                       = "1.2"
          + scm_type                                      = (known after apply)
          + scm_use_main_ip_restriction                   = false
          + use_32_bit_worker                             = true
          + vnet_route_all_enabled                        = true
          + websockets_enabled                            = false
          + worker_count                                  = (known after apply)
        }
    }

  # azurerm_log_analytics_workspace.app will be created
  + resource "azurerm_log_analytics_workspace" "app" {
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + location                           = "japaneast"
      + name                               = "azphoto-dev-app-56189-logs"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "azphoto-dev-rg"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.app will be created
  + resource "azurerm_monitor_diagnostic_setting" "app" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "azphoto-dev-app-56189-diag-setting"
      + target_resource_id         = (known after apply)

      + log {
          + category = "AppServiceAppLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceAuditLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceConsoleLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceHTTPLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServiceIPSecAuditLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + log {
          + category = "AppServicePlatformLogs"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # azurerm_service_plan.app will be created
  + resource "azurerm_service_plan" "app" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "japaneast"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "azphoto-dev-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "azphoto-dev-rg"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

Plan: 20 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 56 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @m-oka-system, Action: `pull_request`*